import random
class Galya():
    def __init__(self):
        self.eql = {
            'a' : {
                '1' : 'велике везіння',
                '2' : 'не бійтеся ризикувати, все бажане здійсниться',
                '3' : 'треба зробити переоцінку життя',
                '4' : 'прекрасне оточення допомагає в справах',
                '5' : 'вигода в фінансових починаннях',
                '6' : 'доброзичливець',
                '7' : 'варто придивитися до невідомої жінки',
                '8' : 'чоловік покровитель',
                '9' : 'не треба забувати рідних'
        },
        'b' : {
            '1' : 'все бажання виконуються',
            '2' : 'бережіть справжніх друзів',
            '3' : 'об’єкт бажання живить взаємні почуття',
            '4' : 'успіх у всіх справах',
            '5' : 'не варто в собі сумніватися',
            '6' : 'спроба недоброзичливців маніпулювати',
            '7' : 'шанувальники',
            '8' : 'таємне захоплення',
            '9' : 'вмійте відокремлювати зерно від плевел'
        },
        'c' : {
            '1' : 'розмови навколо, до яких варто прислухатися',
            '2' : 'спіймана удача за хвіст',
            '3' : 'подарунок',
            '4' : 'зміни в житті тільки в кращу сторону',
            '5' : 'придбання дорогих речей',
            '6' : ' належить приємна суєта',
            '7' : 'заміжня, жінка похилого віку',
            '8' : 'зустріч з одруженим чоловіком',
            '9' : 'хороші новини вже близько'
        },
        'd' : {
            '1' : 'чекає довге розставання',
            '2' : 'належить ряд негативних подій',
            '3' : 'сльози, зрада',
            '4' : 'проблеми зі здоров’ям',
            '5' : 'всі дії відштовхують оточуючих',
            '6' : 'суєта – суєт',
            '7' : 'багато порожніх розмов і заздрості',
            '8' : 'ворог, добре приховує наміру/',
            '9' : ' можливо, будуть погані звістки'
        }
        }
        print("Галя найшла карти!")
    def Gadany(self):
        self.card = self.card.split('/')
        gadany = self.eql[self.card[0]][self.card[1]]
        return gadany
    def random(self):
        self.card = random.choice(['a','b','c','d']) +'/' +str(random.randint(1 , 9))
        print('Галя  дістала карту, запуск гадання')
    def auto_answer(self, counts = 1):
        temp = []
        for i in range(counts):
            self.random()
            temp.append(self.Gadany())

        return temp

if __name__ == '__main__':
    _ = Galya()
    print(_.auto_answer())
